### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.instance: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNWMyYTYyNy05NTRiLTQ2MmEtYWI1NC04ZDM3N2RkZDNlMDM7b2JqZWN0SWQ9MWZjNWI5ZTgtZDljMy00MTc5LThiNmItNDkxZjE4MDFlMDFhO3N1YnNjcmlwdGlvbklkPWM1N2MyYTAyLTI5N2QtNGY2OC05NzliLTE5NjBkZjcyMjYyNzt0ZW5hbnRJZD1lNjdjMTU4OS00NzQ3LTRiNzMtYjdiYi1kYTFiNTY3ZWUxZjU=]
azurerm_service_plan.windows: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan-windows]
azurerm_container_group.jaeger: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.ContainerInstance/containerGroups/onlinestore-containergroup-jaeger]
azurerm_windows_web_app.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website]
azurerm_windows_web_app.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_group.jaeger must be replaced
-/+ resource "azurerm_container_group" "jaeger" {
      ~ dns_name_label              = "" -> "onlinestore-jaeger" # forces replacement
      ~ exposed_port                = [
          - {
              - port     = 16686
              - protocol = "TCP"
            },
          - {
              - port     = 4317
              - protocol = "TCP"
            },
        ] -> (known after apply)
      ~ fqdn                        = "" -> (known after apply)
      ~ id                          = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.ContainerInstance/containerGroups/onlinestore-containergroup-jaeger" -> (known after apply)
      ~ ip_address                  = "20.246.241.111" -> (known after apply)
        name                        = "onlinestore-containergroup-jaeger"
      + network_profile_id          = (known after apply)
      - subnet_ids                  = [] -> null
        tags                        = {
            "environment" = "prod"
        }
      - zones                       = [] -> null
        # (6 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          ~ cpu                          = 0.1 -> 0.05 # forces replacement
          - cpu_limit                    = 0 -> null
          ~ memory                       = 0.5 -> 0.2 # forces replacement
          - memory_limit                 = 0 -> null
            name                         = "jaegertracing-all-in-one"
          - secure_environment_variables = (sensitive value)
            # (2 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ image_registry_credential {
          - user_assigned_identity_id = "" -> null
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_windows_web_app.api will be updated in-place
  ~ resource "azurerm_windows_web_app" "api" {
      ~ app_settings                      = {
          - "OTLPEXPORTER__ENDPOINT" = "http://20.253.83.204:4317"
        } -> (known after apply)
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api"
        name                              = "os-onlinestore-prod-api"
        tags                              = {}
        # (17 unchanged attributes hidden)

      ~ site_config {
            # (23 unchanged attributes hidden)

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_web_app.website will be updated in-place
  ~ resource "azurerm_windows_web_app" "website" {
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website"
        name                              = "os-onlinestore-prod-website"
        tags                              = {}
        # (18 unchanged attributes hidden)

      ~ site_config {
            # (23 unchanged attributes hidden)

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  - app_service_name_api           = "os-onlinestore-prod-api" -> null
  - app_service_name_website       = "os-onlinestore-prod-website" -> null
  + container_instance_jaeger_fqdn = (known after apply)
  + web_app_api_hostname           = "os-onlinestore-prod-api.azurewebsites.net"
  + web_app_api_name               = "os-onlinestore-prod-api"
  + web_app_website_hostname       = "os-onlinestore-prod-website.azurewebsites.net"
  + web_app_website_name           = "os-onlinestore-prod-website"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Instance - plan prod`*